{
  "user": {
    "screen_name": "dotey",
    "name": "宝玉",
    "description": "Prompt Engineer, dedicated to learning and disseminating knowledge about AI, software engineering, and engineering management.",
    "followers_count": 161862,
    "verified": false,
    "is_blue_verified": true
  },
  "date": "20251228",
  "last_updated": "2025-12-28T00:19:45.165530",
  "tweet_count": 1,
  "tweets": [
    {
      "id": "2005069751920337194",
      "text": "一个月，259个PR，497次提交，4万行代码增加，3.8万行删除。每一行，都是AI写的。\n\n这条推文作者是 Claude Code创建者Boris Cherny。2024年9月，他把Claude Code当副业项目做了出来。\n\n用他的话说，完全没想到这东西能长成今天这样：成了无数工程师的核心开发工具，用途早就超出了写代码，运维、研究、甚至非技术场景都有人在用。\n\n他用了两个词形容这项技术：alien and magical。外星的，魔法的。\n\n有意思的是对比。一年前，Claude连生成一条bash命令都经常出转义错误，跑几秒钟、几分钟就断了。那时候只是隐约看到一点苗头：这东西以后也许能派上大用场。\n\n注意这个“隐约”。技术的早期形态往往让人低估它的潜力。就像你第一次看到砖头大的大哥大，很难想象二十年后它会变成你手里的智能手机。\n\n快进到今天。Boris晒的数据是30天的产出：259个PR，497次提交，近8万行代码变动。全部由Claude Code加上Opus 4.5模型完成。而且Claude现在可以连续跑几分钟、几小时、甚至几天（用Stop hooks机制）。\n\n从几秒到几天。这个时间维度的变化，比任何功能更新都说明问题。\n\nBoris说：Increasingly, code is no longer the bottleneck. 代码越来越不是瓶颈了。\n\n以前做软件，想法便宜，实现贵。你有一个点子，变成可运行的代码需要大量时间和人力。现在这个成本在急剧下降。\n\n那瓶颈移到哪了？移到了想清楚要做什么、怎么做。移到了判断和决策。移到了对问题的理解和定义。\n\n换句话说，软件工程的重心正在从“执行”向“思考”迁移。\n\n当然，Boris作为创建者，晒这组数据有宣传的成分。而且量大不等于质量高，一个月8万行变动是什么性质的工作，维护成本怎么样，他没说。\n但即便打个折扣，这个趋势是真实的。AI编程工具在过去一年的进化速度，确实让人意外。\n\nBoris最后说：Software engineering is changing, and we are entering a new period in coding history. And we're still just getting started.\n软件工程正在改变，我们进入了编程史的新纪元。而且我们才刚刚开始。\n\n这话听起来像营销，但越来越像事实。",
      "created_at": "Sun Dec 28 00:14:15 +0000 2025",
      "lang": "zh",
      "media": [
        {
          "type": "photo",
          "id": "2005069743288365056",
          "url": "https://pbs.twimg.com/media/G9NwTuaWMAAiTCV.jpg"
        }
      ],
      "retweet": null,
      "quoted": {
        "id": "2004887829252317325",
        "text": "When I created Claude Code as a side project back in September 2024, I had no idea it would grow to be what it is today. It is humbling to see how Claude Code has become a core dev tool for so many engineers, how enthusiastic the community is, and how people are using it for all sorts of things from coding, to devops, to research, to non-technical use cases. This technology is alien and magical, and it makes it so much easier for people to build and create. Increasingly, code is no longer the bottleneck.\n\nA year ago, Claude struggled to generate bash commands without escaping issues. It worked for seconds or minutes at a time. We saw early signs that it may become broadly useful for coding one day.\n\nFast forward to today. In the last thirty days, I landed 259 PRs -- 497 commits, 40k lines added, 38k lines removed. Every single line was written by Claude Code + Opus 4.5. Claude consistently runs for minutes, hours, and days at a time (using Stop hooks). Software engineering is changing, and we are entering a new period in coding history. And we're still just getting started..",
        "created_at": "Sat Dec 27 12:11:22 +0000 2025",
        "lang": "en",
        "media": [
          {
            "type": "photo",
            "id": "2004882496526127104",
            "url": "https://pbs.twimg.com/media/G9LGAh3WkAAbnBJ.png"
          }
        ],
        "retweet": null,
        "quoted": null,
        "user": {
          "id": "159337660",
          "name": "Boris Cherny",
          "screen_name": "bcherny",
          "description": "Claude Code @anthropicai",
          "followers_count": 44641,
          "friends_count": 120,
          "verified": false,
          "is_blue_verified": true
        },
        "stats": {
          "retweet_count": 797,
          "favorite_count": 10401,
          "reply_count": 535,
          "quote_count": 287
        }
      },
      "stats": {
        "retweet_count": 0,
        "favorite_count": 0,
        "reply_count": 0,
        "quote_count": 0
      }
    }
  ]
}