{
  "user": {
    "screen_name": "dotey",
    "name": "宝玉",
    "description": "Prompt Engineer, dedicated to learning and disseminating knowledge about AI, software engineering, and engineering management.",
    "followers_count": 138377,
    "verified": false,
    "is_blue_verified": true
  },
  "date": "20251014",
  "last_updated": "2025-10-14T01:36:59.930991",
  "tweet_count": 3,
  "tweets": [
    {
      "id": "1977905081379926444",
      "text": "张朝阳谈如何对抗焦虑症，很像写 Prompt：多告诉 AI 该干什么，少说不要干什么，说多了反而可能强化了 AI 负面行为\n\n以下内容是 AI 帮总结的内容\n----\n\n别再试图“战胜”焦虑了：重塑心智的真正法则\n\n我们与深渊的距离，或许比想象中更近。在一个看似寻常的夜晚，围坐篝火旁的张朝阳说：“每个人离抑郁症和焦虑症，只有一步之遥。” 这句话如同一颗投入平静湖面的石子，瞬间激起我们内心深处的涟漪。现代生活的快节奏、无休止的竞争与不确定性，让焦虑如影随形，仿佛成了我们这个时代的集体背景音。我们拼命寻找出口，阅读无数文章，尝试各种方法，试图“战胜”或“消除”这种令人不适的情绪，却往往发现自己陷入了更深的泥潭。\n\n这究竟是为什么？难道我们对抗焦虑的方式从一开始就错了吗？如果说，摆脱焦虑的关键并非与之搏斗，而在于一种截然不同的心智模式与行动哲学，我们是否愿意放下手中早已无效的武器，重新学习一种与内心风暴共处，乃至将其转化为生命动力的智慧？这不仅是一场关于情绪管理的探讨，更是一次深入大脑运作原理、重塑自我认知的心智之旅。\n\n为何越想摆脱，越被牢牢抓住？——焦虑的“强化”陷阱\n要理解这一切，我们首先需要洞察一个深刻的心理学悖论：放大焦虑的最好方法，就是去解决焦虑。这个观点听起来或许有悖常理，但它却精准地揭示了我们为何常常在与负面情绪的斗争中败下阵来。我们的本能反应是，当一个问题（比如焦虑）出现时，就必须立刻找到方法去消除它。然而，正是这种“解决”的意图，为焦虑本身提供了源源不断的养料。\n\n想象一下，你因为担心明天的一次重要会议而焦虑不安。为了缓解这种情绪，你可能会开始反复检查演讲稿，上网搜索所有可能的突发状况，甚至试图通过幻想会议的完美情景来“说服”自己不要紧张。这些行为的初衷都是为了“解决”焦虑，但其潜台词却是：“焦虑是一个巨大的、必须被清除的威胁。” 你越是投入精力去对抗它，就越是在向你的大脑确认——这个威胁是真实且致命的。于是，你的大脑进入高度戒备状态，分泌更多压力荷尔蒙，让你变得更加焦虑。你所有的“努力”，都事与愿违地变成了一个自我强化的负面循环。\n\n这种现象在心理学上被称为“经验性回避”（Experiential Avoidance）。我们试图回避、压抑或消除不想要的内在体验（思想、情绪、记忆），但这种回避行为本身，却极大地限制了我们的生活，并最终让那些我们试图摆脱的东西变得更加强大。就如同陷入流沙，越是挣扎，下陷得越快。无论是通过拖延来回避对失败的恐惧，还是通过强迫性检查来消除不安全感，这些看似“合乎逻辑”的应对方式，都在无形中将我们与焦虑捆绑得更紧。\n\n大脑的可塑性：你不是情绪的囚徒，而是心智的工程师\n要打破这个恶性循环，我们必须首先建立一个颠覆性的信念：我们并非自身情绪的囚徒，而是自我心智的工程师。这个信念的科学基础，便是大脑的神经可塑性（Neuroplasticity）。长久以来，我们习惯于将自己的性格、情绪模式归咎于原生家庭、成长经历或是某种天生的特质，仿佛它们是刻在石头上无法更改的宿命。然而，现代神经科学告诉我们，大脑更像是一块可以被反复雕琢的黏土。\n\n我们的每一次思考、每一个行为，都在物理层面上塑造着大脑的神经回路。当两条神经元被同时激活时，它们之间的连接就会被加强。这个过程可以用一句简单的话来概括：“神经元同步放电，连接就会增强”（Neurons that fire together, wire together）。这意味着，你反复进行的思维和行为模式，会像在森林中反复踩踏走出一条小路一样，在大脑中刻下深刻的、自动化的通路。焦虑的循环之所以难以打破，正是因为它已经形成了一条被反复强化的“高速公路”。\n\n但这个原理同样也为我们指明了出路。既然旧的通路可以被强化，那么新的、更健康的通路同样可以被建立。这赋予了我们一种惊人的力量——通过有意识地选择和实践新的行为模式，我们可以主动地、物理性地重塑自己的大脑结构。我们不必再抱怨过去的经历如何塑造了今天的自己，因为从此刻起，我们所做的每一个选择，都在决定着未来大脑的形态。这不再是哲学层面的鼓舞，而是神经科学层面的事实。你，拥有重新布线自己大脑的权力。\n\n“价值锚定”行动法：在情绪风暴中，找到你的指南针\n认识到大脑的可塑性只是第一步，真正的关键在于如何“施工”。这就引出了应对焦虑的核心策略——我称之为“价值锚定”行动法。其精髓在于，将你的行动准则从“感觉”切换到“价值”。换言之，做你认为重要的事，而不是做感觉舒服的事。\n\n当焦虑来临时，我们本能地想去做那些能让我们“感觉好一点”的事，也就是前文提到的“经验性回避”。而“价值锚定”法则要求我们反其道而行之。首先，你需要清晰地定义什么对你而言是真正重要的——你的核心价值是什么？你想成为一个怎样的人？是成为一个有责任感的父母，一个勤奋上进的职员，还是一个健康自律的人？这些价值，就是你在情绪风暴中赖以导航的“指南针”。\n\n接下来，无论你的内心感受如何翻江倒海，你的行动都只听从这个指南针的指引。你感到社交恐惧，但你的价值是“建立真诚的人际关系”，那么你就去参加那个聚会，哪怕只是待上十分钟。你感到拖延和自我怀疑，但你的价值是“完成对手头工作的承诺”，那么你就打开电脑，写下第一行字。你因为担心健康而焦虑，但你的价值是“过一种积极平衡的生活”，那么你就放下手机，出门散步，而不是无休止地搜索症状。\n\n这个过程的核心在于“接纳”与“行动”的并行。你不必等到焦虑消失了再去行动。恰恰相反，你带着焦虑去行动。你允许焦虑作为一种背景噪音存在，就像允许窗外的雨声存在一样，不去理会它，也不去驱赶它，只是将你的全部注意力聚焦在手头那件符合你价值的事情上。每一次这样的行动，都是在为大脑中那条代表着“健康”、“积极”与“勇敢”的新神经通路添砖加瓦。久而久之，这条新路会变得越来越宽阔，而那条通往焦虑的旧路，则因为无人问津而渐渐荒芜。\n\n生命的修行：从“感受”到“行动”的伟大转向\n\n归根结底，摆脱焦虑困扰的旅程，是一场从“被感受驱动”到“以行动引领”的伟大转向。我们总以为，必须先拥有良好的感觉，才能去过理想的生活。但真相恰恰相反，是先去过理想的生活（即践行你的价值），良好的感觉才会随之而来。\n\n我们的想法和情绪，如同天空中飘过的云朵，变幻莫测，我们无法控制它们何时出现，也无法决定它们是什么形状。试图与每一片“乌云”搏斗，只会让我们精疲力竭。而“价值锚定”的智慧在于，承认云的存在，但让我们的双脚始终稳稳地踩在自己选择的道路上。\n\n语言，在这个过程中扮演着至关重要的角色。它不仅仅是交流的工具，更是塑造思维的模具。每天主动地朗读、交谈，甚至自言自语，都是在用积极的、有结构的声音来占据你的心智带宽，让那些随机产生的负面念头无处扎根。这是一种主动的“心智园艺”，用你想种植的花草去填满土地，野草自然就失去了生长的空间。\n\n所以，请停止与焦虑的战争吧。那是一场注定无法获胜的战斗。真正的自由，在于培养一种能力：无论内心有多少噪音，你都能清晰地听到自己价值观的声音，并让那个声音，而不是恐惧的声音，来决定你下一步的方向。这并非一日之功，而是一生的修行。但每一步，都算数。",
      "created_at": "Tue Oct 14 01:11:33 +0000 2025",
      "lang": "zh",
      "media": [
        {
          "type": "video",
          "id": "1977898414869229568",
          "url": "https://video.twimg.com/amplify_video/1977898414869229568/vid/avc1/852x480/zMAOAvJwslB9cz5T.mp4?tag=21",
          "bitrate": 2176000
        }
      ],
      "retweet": null,
      "quoted": null,
      "stats": {
        "retweet_count": 4,
        "favorite_count": 16,
        "reply_count": 1,
        "quote_count": 0
      }
    },
    {
      "id": "1977905155518390356",
      "text": "原始会话：\nhttps://t.co/moJJ2Vntyx",
      "created_at": "Tue Oct 14 01:11:51 +0000 2025",
      "lang": "ja",
      "media": [],
      "retweet": null,
      "quoted": null,
      "stats": {
        "retweet_count": 0,
        "favorite_count": 1,
        "reply_count": 0,
        "quote_count": 0
      }
    },
    {
      "id": "1977906047013556656",
      "text": "这是由 OpenAI 的 @hemanth_asir 制作的短片，讲述了科技发展的历史。完全由 Sora 制作的短片拼接而成，目前这个拼接过程还很繁琐，据说他们会改进。\n\nhttps://t.co/meTxh2aErR",
      "created_at": "Tue Oct 14 01:15:23 +0000 2025",
      "lang": "zh",
      "media": [
        {
          "type": "video",
          "id": "1977831210505453568",
          "url": "https://video.twimg.com/amplify_video/1977831210505453568/vid/avc1/3780x2160/KKMtckBM_92NMVFn.mp4?tag=21",
          "bitrate": 25128000
        }
      ],
      "retweet": null,
      "quoted": null,
      "stats": {
        "retweet_count": 1,
        "favorite_count": 7,
        "reply_count": 1,
        "quote_count": 0
      }
    }
  ]
}