{
  "user": {
    "screen_name": "dotey",
    "name": "宝玉",
    "description": "Prompt Engineer, dedicated to learning and disseminating knowledge about AI, software engineering, and engineering management.",
    "followers_count": 139564,
    "verified": false,
    "is_blue_verified": true
  },
  "date": "20251019",
  "last_updated": "2025-10-19T01:37:10.945710",
  "tweet_count": 1,
  "tweets": [
    {
      "id": "1979708475430359250",
      "text": "RT @pirrer: 2013年，一名青少年將他當時的全部積蓄 1,300 美元，大約是台幣 4 萬塊，交給父親，指定投資一家他喜歡的公司：特斯拉。父親在當時介面笨拙的 E*Trade 平台開戶，一個耗時數週的繁瑣過程。\n\n然後，這件事徹底從他們的記憶中移除，現在變成了 98…",
      "created_at": "Sun Oct 19 00:37:36 +0000 2025",
      "lang": "zh",
      "media": [],
      "retweet": {
        "id": "1979503482110611712",
        "text": "2013年，一名青少年將他當時的全部積蓄 1,300 美元，大約是台幣 4 萬塊，交給父親，指定投資一家他喜歡的公司：特斯拉。父親在當時介面笨拙的 E*Trade 平台開戶，一個耗時數週的繁瑣過程。\n\n然後，這件事徹底從他們的記憶中移除，現在變成了 98,266 美金，大約 300 萬台幣，馬斯克本人在下面回覆留言「Cool」。\n\n「2013年，我拜託我爸幫我投資特斯拉和馬斯克。我從未見過一家公司、一個產品，或更重要的，一位創辦人，對未來能有如此清晰的願景。我靠著打零工和生日禮金存了 1300 美元。他跟我說他會搞定，我就把現金交給他了，那是我當時所有的錢。果斷梭哈。\n\n那時候，投資個股不像今天這麼容易。Robinhood App 才剛推出，所以我爸必須去搞定那些繁瑣的流程。他在 Etrade 註冊了一個帳戶來進行這筆投資。這是一項多步驟、耗時數週的工程。\n\n日子照常過，我開始忙於其他事情，並以為這件事已經辦妥。幾年後，我問起他，但他對細節記憶模糊。他沒有用 etrade 做任何其他事，也不太確定自己到底有沒有真的完成那筆投資。特斯拉和馬斯克如今已是家喻戶曉的名字。這件事很鬧地成為我們家的一個梗（meme），我們錯過特斯拉。\n\n時間快轉到幾週前，我正跟我爸聊到 ＄OPEN。他決定要投資，於是跑到 etrade 準備註冊一個帳戶（!!）。在註冊過程中，系統提示他，他已經擁有一個帳戶了。而且是在 2013 年建立的。\n\n當他總算搞懂如何登入後，儀表板上顯示出他的投資組合，裡面只有一檔持股 Tesla。225 股，購入成本 $5.83。帳戶總價值：$98,266.50\n\n$1,300 變成了 $98k（約9萬8千美元）。他今天打 FaceTime 跟我分享這個消息。那感覺太震撼了。這是我記憶所及最酷的父子時刻之一。\n\n這就像是在舊褲子口袋裡發現 20 美元的超級加強版。但更重要的是，這件事證明了：以長線思維、近乎非理性地去相信你所信仰的產品、公司和創辦人，這才是終極的 Alpha（超額報酬）。\n\n我對這筆資金的計畫？再把它們忘掉 12 年。",
        "created_at": "Sat Oct 18 11:03:02 +0000 2025",
        "lang": "zh",
        "media": [],
        "retweet": null,
        "quoted": {
          "id": "1979249800626552870",
          "text": "wild story\n\nin 2013, i begged my dad to help me invest in @Tesla and @elonmusk. i had never seen a company, product, or more importantly a founder have such a clear vision of the future. \n\ni had $1300 saved up from odd jobs and a birthday. he told me he would take care of it and i handed over the cash — all my money at the time. decisively all-in. \n\nback then, investing in individual stocks wasn't as easy as it is today. @RobinhoodApp had just launched and so my dad had to navigate the mess that it was. he created an account on @etrade to place the investment. a multi-step, weeks long effort.\n\nlife went on - i became busy with other things and assumed it was taken care of. a few years later, i asked him about it and he was fuzzy on the details. he didn't use etrade for anything else and couldn't confidently remember placing the actual investment. Tesla and Elon were now house-hold names. it hilariously became family meme — we missed out on tesla.\n\nfast forward to a few weeks ago, i was telling my dad about $OPEN. he decides to make an investment and goes to @etrade to setup an account (!!). during account setup, he's told that he already has an account with them. it was created in 2013.\n\nwhen he figured out how to log in, the dashboard displays the portfolio with its only holding — @Tesla. 225 shares purchased for $5.83. the total account value:\n\n$98,266.50\n\n$1,300 → $98k. he face-timed me today to share the news. it was electric. one of the coolest father-son moments i can remember.\n\nit's like finding a $20 in an old pair of pants on steroids. but more importantly it goes to show that investing in products, companies, and founders you believe in irrationally with a long-term mindset is the ultimate alpha.\n\nmy plan for the funds? forget about them for another 12 years. \n\n--\n\nsidenote: yes, i moved him to @RobinhoodApp cc @vladtenev",
          "created_at": "Fri Oct 17 18:14:59 +0000 2025",
          "lang": "en",
          "media": [
            {
              "type": "photo",
              "id": "1979238664937881600",
              "url": "https://pbs.twimg.com/media/G3erFE1XQAA2atH.jpg"
            }
          ],
          "retweet": null,
          "quoted": null,
          "user": {
            "id": "58916964",
            "name": "jpa",
            "screen_name": "josephpalbanese",
            "description": "exploring · prev. founder/ceo @stir, before that @bitwiseinvest, @meta, @yikyakapp",
            "followers_count": 9568,
            "friends_count": 1757,
            "verified": false,
            "is_blue_verified": true
          },
          "stats": {
            "retweet_count": 607,
            "favorite_count": 11018,
            "reply_count": 378,
            "quote_count": 81
          }
        },
        "user": {
          "id": "7007922",
          "name": "fox hsiao",
          "screen_name": "pirrer",
          "description": "https://t.co/ADltMSqInz Lets talk abt startup, game, crypto & AI. A starter, Founder of iCook / INSIDE",
          "followers_count": 19564,
          "friends_count": 1281,
          "verified": false,
          "is_blue_verified": true
        },
        "stats": {
          "retweet_count": 23,
          "favorite_count": 201,
          "reply_count": 7,
          "quote_count": 1
        }
      },
      "quoted": null,
      "stats": {
        "retweet_count": 23,
        "favorite_count": 0,
        "reply_count": 0,
        "quote_count": 0
      }
    }
  ]
}